/*
SQLyog Ultimate v12.08 (64 bit)
MySQL - 5.7.24-log : Database - house
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`house` /*!40100 DEFAULT CHARACTER SET utf8 COLLATE utf8_bin */;

USE `house`;

/*Table structure for table `category` */

DROP TABLE IF EXISTS `category`;

CREATE TABLE `category` (
  `cid` int(11) NOT NULL AUTO_INCREMENT,
  `cname` varchar(10) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`cid`)
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

/*Data for the table `category` */

insert  into `category`(`cid`,`cname`) values (1,'单人间'),(2,'标准间'),(3,'大床房'),(4,'套间'),(11,'总统套房');

/*Table structure for table `dingdan` */

DROP TABLE IF EXISTS `dingdan`;

CREATE TABLE `dingdan` (
  `oid` int(11) NOT NULL AUTO_INCREMENT,
  `cname` varchar(10) COLLATE utf8_bin DEFAULT NULL,
  `money` int(11) DEFAULT NULL,
  `consumer` varchar(10) COLLATE utf8_bin DEFAULT NULL,
  `telephone` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `comedate` date DEFAULT NULL,
  `departuredate` date DEFAULT NULL,
  `ostate` varchar(10) COLLATE utf8_bin DEFAULT NULL,
  `date` date DEFAULT NULL,
  `hid` int(11) DEFAULT NULL,
  PRIMARY KEY (`oid`)
) ENGINE=InnoDB AUTO_INCREMENT=201806255 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

/*Data for the table `dingdan` */

insert  into `dingdan`(`oid`,`cname`,`money`,`consumer`,`telephone`,`comedate`,`departuredate`,`ostate`,`date`,`hid`) values (20180622,'单人间',99,'赵胜','13284784478','2018-06-23','2018-06-24','待处理','2018-06-23',NULL),(20180623,'标准间',199,'李春梅','15948384923','2018-06-22','2018-06-23','待处理','2018-06-22',NULL),(20180624,'大床房',199,'孟静','18728395761','2018-06-26','2018-06-27','待处理','2018-06-26',NULL),(20180625,'单人间',99,'李天一','18954564897','2018-06-22','2018-06-23','待处理','2018-06-22',NULL),(20180626,'套间',399,'王凯五','13701827134','2018-06-22','2018-06-23','待处理','2018-06-22',NULL),(20180627,'套间',399,'曹飞飞','15846684565','2018-06-22','2018-06-23','待处理','2018-06-22',NULL),(20180628,'大床房',199,'赵日天','18074561234','2018-06-22','2018-06-23','已完成','2018-06-22',NULL),(20180629,'单人间',99,'王毅','13284564789','2018-12-10','2018-12-11','待处理','2018-12-10',NULL),(20180630,'单人间',99,'李菲','13284624478','2018-12-11','2018-12-12','待处理','2018-12-11',NULL),(20180631,'套间',399,'张海天','13056549849','2018-12-27','2018-12-28','待处理','2018-12-27',NULL),(20180632,'套间',399,'张嗨嗨','15816548994','2018-12-27','2018-12-28','待处理','2018-12-27',NULL),(20180633,'大床房',199,'李天王','18056465465','2018-06-26','2018-06-27','已完成','2018-06-26',NULL),(20180634,'单人间',99,'王五','13215649845','2018-12-19','2018-12-20','待处理','2018-12-19',NULL),(20180635,'大床房',199,'李小萌','13756456484','2018-06-26','2018-06-27','待处理','2018-06-26',NULL),(20180636,'标准间',199,'赵小天','15812312384','2018-06-22','2018-06-23','待处理','2018-06-22',NULL),(20180637,'标准间',199,'朝日明','17815649848','2018-06-22','2018-06-23','待处理','2018-06-22',NULL),(20180638,'单人间',99,'李斯','13587498498','2018-12-24','2018-12-25','待处理','2018-12-24',NULL),(20180639,'套间',399,'张大鹏','13648949889','2018-12-27','2018-12-28','待处理','2018-12-27',NULL),(20180640,'大床房',199,'李达','15032156484','2018-12-19','2018-12-20','已取消','2018-12-19',NULL),(20180641,'套间',399,'蔡武困','13787894561','2018-12-27','2018-12-28','待处理','2018-12-27',NULL),(20180642,'大床房',199,'五沟王','17815648931','2018-12-28','2018-12-29','待处理','2018-12-28',NULL),(20180643,'单人间',99,'二蛋','17815649849','2018-12-24','2018-12-25','待处理','2018-12-24',NULL),(20180644,'标准间',199,'赵海','13584984982','2018-06-22','2018-06-23','待处理','2018-06-22',NULL),(201806232,'单人间',99,'吴钩','17848484585','2018-12-28','2018-12-29','待处理','2018-12-28',NULL),(201806233,'标准间',199,'赵天','17888548488','2018-12-28','2018-12-29','待处理','2018-12-28',NULL),(201806234,'标准间',199,'吴飞','13548948238','2018-12-28','2018-12-29','已预订','2018-12-28',201),(201806235,'标准间',199,'张天','15812315648','2018-06-22','2018-06-23','已取消','2018-06-22',NULL),(201806236,'标准间',199,'王海龙','13721656484','2018-06-22','2018-06-23','已取消','2018-06-22',NULL),(201806237,'单人间',99,'李斐','18023156484','2018-12-27','2018-12-28','已取消','2018-12-27',NULL),(201806238,'单人间',99,'李达','15048494328','2018-12-27','2018-12-28','已取消','2018-12-27',NULL),(201806239,'大床房',199,'李哈','18564891345','2018-12-27','2018-12-28','已取消','2018-12-27',NULL),(201806240,'大床房',199,'王灿','13701564825','2018-12-27','2018-12-28','已取消','2018-12-27',NULL),(201806241,'大床房',199,'王龙','15038184625','2018-12-27','2018-12-28','已取消','2018-12-27',NULL),(201806242,'大床房',199,'李潇','15023154842','2018-12-27','2018-12-28','待处理','2018-12-27',NULL),(201806243,'套房',399,'张三','13705615482','2018-12-19','2018-12-20','已完成','2018-12-19',NULL),(201806244,'套房',399,'李四','13721456482','2018-12-19','2018-12-20','已完成','2018-12-19',NULL),(201806245,'套房',399,'马海','13851565687','2018-12-19','2018-12-20','已完成','2018-12-19',NULL),(201806246,'单人间',99,'王武','15023154832','2018-12-19','2018-12-20','已完成','2018-12-19',NULL),(201806247,'单人间',99,'骁龙','18752311564','2018-12-19','2018-12-20','已完成','2018-12-19',NULL),(201806248,'单人间',99,'崇隆','13521564852','2018-12-19','2018-12-20','已完成','2018-12-19',NULL),(201806249,'标准间',199,'黄气','13515482384','2018-12-27','2018-12-28','待处理','2018-12-27',NULL),(201806250,'标准间',199,'黄无','18721564542','2018-12-27','2018-12-28','待处理','2018-12-27',NULL),(201806251,'标准间',199,'黄天','13751465482','2018-12-27','2018-12-28','已完成','2018-12-27',NULL),(201806252,'大床房',199,'田小龙','18723135452','2018-06-22','2018-06-23','待处理','2018-06-22',NULL),(201806253,'大床房',199,'田海','15089486432','2018-06-22','2018-06-23','待处理','2018-06-22',NULL),(201806254,'大床房',199,'甜甜','17032154852','2018-06-22','2018-06-23','待处理','2018-06-22',NULL);

/*Table structure for table `house` */

DROP TABLE IF EXISTS `house`;

CREATE TABLE `house` (
  `hid` int(11) NOT NULL AUTO_INCREMENT,
  `cname` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `hstate` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `hfloor` int(11) DEFAULT NULL,
  PRIMARY KEY (`hid`)
) ENGINE=InnoDB AUTO_INCREMENT=706 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

/*Data for the table `house` */

insert  into `house`(`hid`,`cname`,`hstate`,`hfloor`) values (101,'单人间','空房',1),(102,'单人间','空房',1),(103,'单人间','脏房',1),(104,'单人间','空房',1),(105,'单人间','住人',1),(106,'单人间','空房',1),(107,'单人间','脏房',1),(201,'标准间','预订',2),(202,'标准间','住人',2),(203,'标准间','空房',2),(204,'标准间','长包',2),(205,'标准间','空房',2),(206,'标准间','钟点',2),(207,'标准间','空房',2),(301,'大床房','空房',3),(302,'大床房','脏房',3),(303,'大床房','住人',3),(304,'大床房','空房',3),(305,'大床房','空房',3),(306,'大床房','长包',3),(307,'大床房','空房',3),(401,'套间','空房',4),(402,'套间','空房',4),(403,'套间','住人',4),(404,'套间','住人',4),(405,'套间','长包',4),(406,'套间','空房',4),(407,'套间','空房',4),(705,'总统套房','长包',7);

/*Table structure for table `user` */

DROP TABLE IF EXISTS `user`;

CREATE TABLE `user` (
  `uid` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `password` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `telephone` varchar(20) COLLATE utf8_bin DEFAULT NULL,
  `email` varchar(30) COLLATE utf8_bin DEFAULT NULL,
  `hotelname` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`uid`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

/*Data for the table `user` */

insert  into `user`(`uid`,`username`,`password`,`telephone`,`email`,`hotelname`) values (1,'admin','admin',NULL,NULL,'如家酒店'),(2,'17shou','asdas','1503213848','q875243448@gmail.com',NULL),(5,'曹飞飞','qqweqwe','1503213848','89798798@qq.com',NULL),(6,'aaa','123456','15032156456','wetytreWE@qq.com',NULL);

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
